import type { Faq } from "../models/faq";

const subject = encodeURIComponent("שלום שרי, מתעניינת לגבי תוכנת פוטושופ בשביל הקורסים שלך");
const gmailLink = `https://mail.google.com/mail/?view=cm&fs=1&to=sari.is.your.dream@gmail.com&su=${subject}`;

export const faqs: Faq[] = [
    {
        question: "אין לי פוטושופ! מה עושים?",
        answer: `אני ממליצה לך כמובן לעבוד עם תוכנת פוטושופ מקורית 
אבל בתור התחלה אם אין לך גישה לתוכנה
מצרפת לך כאן קישור לפוטופי [https://www.photopea.com/](https://www.photopea.com/)
תוכנת רשת שדומה מאד לפוטושופ 
(שני את השפה לאנגלית כדי שיהיה לך קל עם ההדרכה שלי:))
שימי לב שזו ברירת מחדל - ותוכנת פוטושופ המקורית מומלצת בהרבה!
הי, ואם אין לך חיבור לאינטרנט? או שאת רוצה דווקא פוטושופ? 
 פני אלי [כאן במייל](${gmailLink}) – יש לי עוד פתרונות להציע לך.`
    },
    {
        question: "הקורס זמין לצפייה כל הזמן?",
        answer: `בדיוק!
את יכולה לצפות בסרטונים שוב ושוב ללא הגבלה של זמן או תאריך.`
    },
    {
        question: "משנה איזו גרסת פוטושופ יש לי?",
        answer: `לא משנה בכלל איזו גרסה הפוטושופ שלך.
ההדרכה היא על כל הגרסאות וכשיש שינויים- יש הסבר על ההבדלים.`
    },
    {
        question: "איזה פוטושופ כדאי? עברית או אנגלית?",
        answer: `ההדרכה היא על פוטושופ אנגלית- משום שזו השפה הרשמית של הפוטושופ.
(פוטושופ בעברית זו אינה תוכנה מקורית
ולכן בד"כ התוכנה תהיה עם הבדלים ושיבושים שונים בתרגום שלה.)
אם נח לך יותר עברית- זה בסדר גמור ואת אמורה להסתדר מצוין גם עם ההדרכה.`
    },
    {
        question: "יש כל-כך הרבה קורסים לעיבוד תמונה! במה הקורס שלך שונה?",
        answer: `ההבדל האחד והיחיד הוא שהקורס קצרצר, ממוקד, וקליט! 
את כל זה לא תמצאי בשום מקום אחר! (מוזמנת לחפש ಠ◡ಠ)
זה לא אומר שהקורס לא מקצועי.
וזה לא אומר שהקורס לא מלמד אותך את כ-ל מה שאת צריכה לדעת כדי לעבד תמונה
אבל הוא בנוי בצורה קלה מאד –מאד לצפייה וליישום 
הסרטונים בנויים שלב שלב ומוסברים היטב
בסוף כל סרטון יש שיעורי בית קצרים על החומר 
עם מענה וליווי ללא הגבלת זמן.
כן, זה מתאים בדיוק לך- שממש אין לך זמן ללימודי מקצוע נוספים 
אבל...
את רק רוצה לדעת כבר איך מאירים את התמונה ומחליפים שמיים, ושמים פרצוף מחייך במקום עצוב, הי! וגם- 
נותנים גוון כזה יפה של שלכת... ומצד שני - לא רוצה להשתגע עם שעות לימוד מפרכות...`
    }
]